* Packages
Run all as root.
** Apt
#+BEGIN_SRC sh :dir "/sudo::" :results output verbatim
apt update
apt upgrade
#+END_SRC

#+RESULTS:

#+NAME: apt-repos
| name | comment |
|------+---------|
|      |         |


#+NAME: apt-sources
| name             | comment                                           |
|------------------+---------------------------------------------------|
| curl             |                                                   |
| gawk             | gnu awk, cause it's better                        |
| wget             |                                                   |
| xclip            |                                                   |
| pass             |                                                   |
| openvpn          |                                                   |
| calibre          |                                                   |
| htop             |                                                   |
| racket           |                                                   |
| dict             | dictionary lookups                                |
| dictd            |                                                   |
| dict-gcide       | Collaborative International Dictionary of English |
| golang           | so hot right now                                  |
| transmission     |                                                   |
| paperkey         | backing up /restoring GPG keys                    |
| emacs26          | requires ubuntu 19+                               |
| cmake            | requires ubuntu 19+, for libvterm                 |
| libtool-bin      | for libvterm                                      |
| fonts-firacode   | for doom emacs                                    |
| zlib1g-dev       | for installing python w/ pyenv                    |
| build-essential  | python + pyenv                                    |
| libssl-dev       | python + pyenv                                    |
| libbz2-dev       | python + pyenv                                    |
| libreadline-dev  | python + pyenv                                    |
| libsqlite3-dev   | python + pyenv                                    |
| llvm             | python + pyenv                                    |
| libncurses5-dev  | python + pyenv                                    |
| libncursesw5-dev | python + pyenv                                    |
| xz-utils         | python + pyenv                                    |
| tk-dev           | python + pyenv                                    |
| libffi-dev       | python + pyenv                                    |
| liblzma-dev      | python + pyenv                                    |
| python-openssl   | python + pyenv                                    |

#+BEGIN_SRC elisp :var table=apt-repos
(s-join " " (-map 'car table))
#+END_SRC

#+RESULTS:

#+NAME: apt-repo-string
#+RESULTS:

#+BEGIN_SRC elisp :var table=apt-sources
(s-join " " (-map 'car table))
#+END_SRC

#+NAME: apt-source-string
#+RESULTS:
: curl gawk wget xclip pass openvpn calibre htop racket golang transmission paperkey emacs26 cmake libtool-bin fonts-firacode zlib1g-dev build-essential libssl-dev libbz2-dev libreadline-dev libsqlite3-dev llvm libncurses5-dev libncursesw5-dev xz-utils tk-dev libffi-dev liblzma-dev python-openssl


#+BEGIN_SRC sh :var sources=apt-repo-string :dir "/sudo::" :results output verbatim
yes | add-apt-repository --remove $sources
apt update
#+END_SRC

#+RESULTS:
#+begin_example
 Bitwise PPA
 More info: https://launchpad.net/~ramon-fried/+archive/ubuntu/bitwise
[33m0% [Working][0m            Hit:1 http://security.ubuntu.com/ubuntu eoan-security InRelease
[33m0% [Waiting for headers] [Connecting to ppa.launchpad.net (91.189.95.83)][0m                                                                         Hit:2 http://us.archive.ubuntu.com/ubuntu eoan InRelease
[33m                                                                         0% [Waiting for headers] [Waiting for headers][0m                                              Hit:3 http://us.archive.ubuntu.com/ubuntu eoan-updates InRelease
[33m                                              0% [Waiting for headers][0m[33m0% [Waiting for headers] [Waiting for headers][0m                                              Hit:4 http://us.archive.ubuntu.com/ubuntu eoan-backports InRelease
[33m                                              0% [Waiting for headers][0m                        Hit:5 http://ppa.launchpad.net/kelleyk/emacs/ubuntu eoan InRelease
[33m                        0% [Working][0m[33m0% [Working][0m[33m0% [Working][0m[33m0% [Working][0m[33m20% [Working][0m             Reading package lists... 0%Reading package lists... 0%Reading package lists... 0%Reading package lists... 3%Reading package lists... 3%Reading package lists... 7%Reading package lists... 7%Reading package lists... 9%Reading package lists... 9%Reading package lists... 9%Reading package lists... 9%Reading package lists... 9%Reading package lists... 9%Reading package lists... 9%Reading package lists... 9%Reading package lists... 41%Reading package lists... 41%Reading package lists... 72%Reading package lists... 72%Reading package lists... 89%Reading package lists... 89%Reading package lists... 89%Reading package lists... 89%Reading package lists... 89%Reading package lists... 89%Reading package lists... 90%Reading package lists... 90%Reading package lists... 91%Reading package lists... 91%Reading package lists... 92%Reading package lists... 92%Reading package lists... 92%Reading package lists... 92%Reading package lists... 92%Reading package lists... 92%Reading package lists... 92%Reading package lists... 92%Reading package lists... 93%Reading package lists... 93%Reading package lists... 94%Reading package lists... 94%Reading package lists... 94%Reading package lists... 94%Reading package lists... 94%Reading package lists... 94%Reading package lists... 94%Reading package lists... 94%Reading package lists... 94%Reading package lists... 94%Reading package lists... 94%Reading package lists... 94%Reading package lists... 94%Reading package lists... 94%Reading package lists... 94%Reading package lists... 94%Reading package lists... 95%Reading package lists... 95%Reading package lists... 96%Reading package lists... 96%Reading package lists... 96%Reading package lists... 96%Reading package lists... 96%Reading package lists... 96%Reading package lists... 96%Reading package lists... 96%Reading package lists... 97%Reading package lists... 97%Reading package lists... 98%Reading package lists... 98%Reading package lists... 98%Reading package lists... 98%Reading package lists... 98%Reading package lists... 98%Reading package lists... 98%Reading package lists... 98%Reading package lists... 98%Reading package lists... 98%Reading package lists... 98%Reading package lists... 98%Reading package lists... 98%Reading package lists... 98%Reading package lists... 98%Reading package lists... 98%Reading package lists... Done
Building dependency tree... 0%Building dependency tree... 0%Building dependency tree... 0%Building dependency tree... 50%Building dependency tree... 50%Building dependency tree       
Reading state information... 0%Reading state information... 0%Reading state information... Done
8 packages can be upgraded. Run 'apt list --upgradable' to see them.
#+end_example

#+BEGIN_SRC sh :var sources=apt-source-string :dir "/sudo::" :results output verbatim
yes | apt install $sources
#+END_SRC

#+RESULTS:
#+begin_example
Reading package lists... 0%Reading package lists... 100%Reading package lists... Done
Building dependency tree... 0%Building dependency tree... 0%Building dependency tree... 50%Building dependency tree... 50%Building dependency tree       
Reading state information... 0%Reading state information... 0%Reading state information... Done
build-essential is already the newest version (12.8ubuntu1).
cmake is already the newest version (3.13.4-1build1).
curl is already the newest version (7.65.3-1ubuntu3).
gawk is already the newest version (1:4.2.1+dfsg-1.1build1).
htop is already the newest version (2.2.0-2).
libbz2-dev is already the newest version (1.0.6-9.2).
libffi-dev is already the newest version (3.2.1-9).
liblzma-dev is already the newest version (5.2.4-1).
libncurses5-dev is already the newest version (6.1+20190803-1ubuntu1).
libncursesw5-dev is already the newest version (6.1+20190803-1ubuntu1).
libreadline-dev is already the newest version (8.0-3).
libssl-dev is already the newest version (1.1.1c-1ubuntu4).
libtool-bin is already the newest version (2.4.6-11).
openvpn is already the newest version (2.4.7-1ubuntu2).
wget is already the newest version (1.20.3-1ubuntu1).
xz-utils is already the newest version (5.2.4-1).
zlib1g-dev is already the newest version (1:1.2.11.dfsg-1ubuntu3).
calibre is already the newest version (3.46.0+dfsg-1).
fonts-firacode is already the newest version (1.207+dfsg1-1).
llvm is already the newest version (1:9.0-49~exp1).
paperkey is already the newest version (1.6-1).
pass is already the newest version (1.7.3-2).
python-openssl is already the newest version (19.0.0-1).
racket is already the newest version (7.2+dfsg1-2ubuntu2).
tk-dev is already the newest version (8.6.9+1).
transmission is already the newest version (2.94-2ubuntu1).
xclip is already the newest version (0.13-1).
libsqlite3-dev is already the newest version (3.29.0-2ubuntu0.2).
emacs26 is already the newest version (26.3~1.git96dd019-kk1+19.10).
The following packages were automatically installed and are no longer required:
  fonts-font-awesome fonts-liberation2 freerdp2-x11 libabw-0.1-1
  libadplug-2.2.1-0v5 libaudiofile1 libbinio1v5 libboost-date-time1.67.0
  libboost-filesystem1.67.0 libboost-iostreams1.67.0 libboost-locale1.67.0
  libboost-system1.67.0 libboost-thread1.67.0 libcdio-cdda2 libcdio-paranoia2
  libcdr-0.1-1 libclucene-contribs1v5 libclucene-core1v5 libcmis-0.5-5v5
  libcolamd2 libe-book-0.1-1 libebur128-1 libeot0 libepubgen-0.1-1
  libetonyek-0.1-1 libexttextcat-2.0-0 libexttextcat-data libfreecell-solver0
  libfreehand-0.1-1 libfreerdp-client2-2 libfreerdp2-2
  libgrantlee-textdocument5 libid3tag0 libkf5plotting5 libkf5torrent6
  libkf5webkit5 libkgantt2 libkgantt2-l10n libkolabxml1v5 libktorrent-l10n
  liblangtag-common liblangtag1 libmhash2 libmikmod3 libmpdclient2
  libmspub-0.1-1 libmwaw-0.3-3 libmythes-1.2-0 libodfgen-0.1-1 liborcus-0.14-0
  libpagemaker-0.0-0 libphonenumber7 libprotobuf17 libqgpgme7
  libqt5networkauth5 libraptor2-0 librasqal3 librdf0 librevenge-0.0-0
  libsdl2-2.0-0 libsidplayfp4 libstartup-notification0 libsuitesparseconfig5
  libvisio-0.1-1 libvncclient1 libwinpr2-2 libwpd-0.10-10 libwpg-0.3-3
  libwps-0.4-4 libxerces-c3.2 libxmlsec1 libxmlsec1-nss libyajl2 libzzip-0-13
  lp-solve mariadb-client-core-10.3 mariadb-common mariadb-server-core-10.3
  qtgstreamer-plugins-qt5
Use 'apt autoremove' to remove them.
The following additional packages will be installed:
  golang-1.12 golang-1.12-doc golang-1.12-go golang-1.12-race-detector-runtime
  golang-1.12-src golang-doc golang-go golang-race-detector-runtime golang-src
Suggested packages:
  bzr | brz mercurial subversion
The following NEW packages will be installed:
  golang golang-1.12 golang-1.12-doc golang-1.12-go
  golang-1.12-race-detector-runtime golang-1.12-src golang-doc golang-go
  golang-race-detector-runtime golang-src
0 upgraded, 10 newly installed, 0 to remove and 0 not upgraded.
Need to get 64.4 MB of archives.
After this operation, 336 MB of additional disk space will be used.
Do you want to continue? [Y/n] [33m0% [Working][0m            Get:1 http://us.archive.ubuntu.com/ubuntu eoan/main amd64 golang-1.12-src amd64 1.12.10-1ubuntu1 [12.8 MB]
[33m0% [1 golang-1.12-src 2,610 B/12.8 MB 0%][0m[33m2% [1 golang-1.12-src 1,665 kB/12.8 MB 13%][0m[33m11% [1 golang-1.12-src 9,141 kB/12.8 MB 72%][0m[33m                                            18% [Working][0m             Get:2 http://us.archive.ubuntu.com/ubuntu eoan/main amd64 golang-1.12-go amd64 1.12.10-1ubuntu1 [48.4 MB]
[33m18% [2 golang-1.12-go 2,609 B/48.4 MB 0%][0m[33m27% [2 golang-1.12-go 7,670 kB/48.4 MB 16%][0m[33m                                           37% [2 golang-1.12-go 15.5 MB/48.4 MB 32%][0m[33m47% [2 golang-1.12-go 23.8 MB/48.4 MB 49%][0m[33m58% [2 golang-1.12-go 32.5 MB/48.4 MB 67%][0m[33m67% [2 golang-1.12-go 39.9 MB/48.4 MB 82%][0m[33m76% [2 golang-1.12-go 46.8 MB/48.4 MB 97%][0m[33m                                          80% [Working][0m             Get:3 http://us.archive.ubuntu.com/ubuntu eoan/main amd64 golang-1.12-doc all 1.12.10-1ubuntu1 [2,513 kB]
[33m80% [3 golang-1.12-doc 0 B/2,513 kB 0%][0m[33m                                       85% [Working][0m             Get:4 http://us.archive.ubuntu.com/ubuntu eoan/main amd64 golang-1.12 all 1.12.10-1ubuntu1 [11.2 kB]
[33m85% [4 golang-1.12 11.2 kB/11.2 kB 100%][0m                                        Get:5 http://us.archive.ubuntu.com/ubuntu eoan/main amd64 golang-src amd64 2:1.12~1ubuntu1 [3,996 B]
                                        Get:6 http://us.archive.ubuntu.com/ubuntu eoan/main amd64 golang-go amd64 2:1.12~1ubuntu1 [22.0 kB]
[33m                                        89% [6 golang-go 22.0 kB/22.0 kB 100%][0m                                      Get:7 http://us.archive.ubuntu.com/ubuntu eoan/main amd64 golang-doc all 2:1.12~1ubuntu1 [2,952 B]
[33m                                      93% [Working][0m             Get:8 http://us.archive.ubuntu.com/ubuntu eoan/main amd64 golang amd64 2:1.12~1ubuntu1 [2,900 B]
[33m93% [8 golang 2,900 B/2,900 B 100%][0m[33m                                   95% [Working][0m             Get:9 http://us.archive.ubuntu.com/ubuntu eoan/main amd64 golang-1.12-race-detector-runtime amd64 0.0+svn332029-0ubuntu1 [709 kB]
[33m95% [9 golang-1.12-race-detector-runtime 30.5 kB/709 kB 4%][0m[33m                                                           98% [Waiting for headers][0m                         Get:10 http://us.archive.ubuntu.com/ubuntu eoan/main amd64 golang-race-detector-runtime amd64 2:1.12~1ubuntu1 [3,788 B]
[33m                         100% [Working][0m              Fetched 64.4 MB in 5s (13.5 MB/s)
Selecting previously unselected package golang-1.12-src.
(Reading database ... (Reading database ... 5%(Reading database ... 10%(Reading database ... 15%(Reading database ... 20%(Reading database ... 25%(Reading database ... 30%(Reading database ... 35%(Reading database ... 40%(Reading database ... 45%(Reading database ... 50%(Reading database ... 55%(Reading database ... 60%(Reading database ... 65%(Reading database ... 70%(Reading database ... 75%(Reading database ... 80%(Reading database ... 85%(Reading database ... 90%(Reading database ... 95%(Reading database ... 100%(Reading database ... 290547 files and directories currently installed.)
Preparing to unpack .../0-golang-1.12-src_1.12.10-1ubuntu1_amd64.deb ...
Unpacking golang-1.12-src (1.12.10-1ubuntu1) ...
Selecting previously unselected package golang-1.12-go.
Preparing to unpack .../1-golang-1.12-go_1.12.10-1ubuntu1_amd64.deb ...
Unpacking golang-1.12-go (1.12.10-1ubuntu1) ...
Selecting previously unselected package golang-1.12-doc.
Preparing to unpack .../2-golang-1.12-doc_1.12.10-1ubuntu1_all.deb ...
Unpacking golang-1.12-doc (1.12.10-1ubuntu1) ...
Selecting previously unselected package golang-1.12.
Preparing to unpack .../3-golang-1.12_1.12.10-1ubuntu1_all.deb ...
Unpacking golang-1.12 (1.12.10-1ubuntu1) ...
Selecting previously unselected package golang-src.
Preparing to unpack .../4-golang-src_2%3a1.12~1ubuntu1_amd64.deb ...
Unpacking golang-src (2:1.12~1ubuntu1) ...
Selecting previously unselected package golang-go.
Preparing to unpack .../5-golang-go_2%3a1.12~1ubuntu1_amd64.deb ...
Unpacking golang-go (2:1.12~1ubuntu1) ...
Selecting previously unselected package golang-doc.
Preparing to unpack .../6-golang-doc_2%3a1.12~1ubuntu1_all.deb ...
Unpacking golang-doc (2:1.12~1ubuntu1) ...
Selecting previously unselected package golang.
Preparing to unpack .../7-golang_2%3a1.12~1ubuntu1_amd64.deb ...
Unpacking golang (2:1.12~1ubuntu1) ...
Selecting previously unselected package golang-1.12-race-detector-runtime.
Preparing to unpack .../8-golang-1.12-race-detector-runtime_0.0+svn332029-0ubuntu1_amd64.deb ...
Unpacking golang-1.12-race-detector-runtime (0.0+svn332029-0ubuntu1) ...
Selecting previously unselected package golang-race-detector-runtime.
Preparing to unpack .../9-golang-race-detector-runtime_2%3a1.12~1ubuntu1_amd64.deb ...
Unpacking golang-race-detector-runtime (2:1.12~1ubuntu1) ...
Setting up golang-1.12-race-detector-runtime (0.0+svn332029-0ubuntu1) ...
Setting up golang-1.12-src (1.12.10-1ubuntu1) ...
Setting up golang-src (2:1.12~1ubuntu1) ...
Setting up golang-1.12-go (1.12.10-1ubuntu1) ...
Setting up golang-race-detector-runtime (2:1.12~1ubuntu1) ...
Setting up golang-go (2:1.12~1ubuntu1) ...
Setting up golang-1.12-doc (1.12.10-1ubuntu1) ...
Setting up golang-1.12 (1.12.10-1ubuntu1) ...
Setting up golang-doc (2:1.12~1ubuntu1) ...
Setting up golang (2:1.12~1ubuntu1) ...
Processing triggers for man-db (2.8.7-3) ...
#+end_example

*** Antibody
#+BEGIN_SRC shell :dir "/sudo::"
curl -sfL git.io/antibody | sh -s - -b /usr/local/bin
#+END_SRC
#+RESULTS:
** Compiled
Trans -- For translating stuff, seems to work pretty stably.
#+BEGIN_SRC shell
wget https://git.io/trans -O /tmp/trans
chmod u+x /tmp/trans
mv /tmp/trans $HOME/.local/bin
#+END_SRC

#+RESULTS:

* Shell
#+BEGIN_SRC shell
# NOTE You probably want to generate an SSH key for bitbucket for this machine.
git clone https://bitbucket.org/txru/passwords.git ~/.password-store
# NOTE You should fetch your GPG key yourself.
git clone https://bitbucket.org/txru/dotfiles.git ~/.dotfiles
python3 ~/.dotfiles/home/copier.py
#+END_SRC
* Emacs
#+BEGIN_SRC shell
git clone https://github.com/hlissner/doom-emacs ~/.emacs.d
yes | ~/.emacs.d/bin/doom install

mkdir -p ~/.emacs.d/.local/straight/repos/emacs-libvterm/build
cd ~/.emacs.d/.local/straight/repos/emacs-libvterm/build
cmake ..
make
cd -
#+END_SRC
#+END_SRC
* Python
#+NAME: general-purpose-python
| name       | comment                    |
|------------+----------------------------|
| black      | formatting                 |
| pyls       | LSP                        |
| ipython    | repl                       |
| poetry     | dependency management      |
| virtualenv | envs                       |
| manimlib   | 3blue1brown visualizations |

#+BEGIN_SRC elisp :var table=general-purpose-python
(s-join " " (-map 'car table))
#+END_SRC

#+NAME: python-libs
#+RESULTS:
: black pyls ipython poetry virtualenv manimlib

#+BEGIN_SRC shell :var libs=python-libs
git clone https://github.com/pyenv/pyenv.git ~/.pyenv
git clone https://github.com/momo-lab/xxenv-latest.git "$(pyenv root)"/plugins/xxenv-latest
pyenv latest install
pyenv global $(pyenv versions | tail -n 1)
pip install --user $libs
mkdir -p $HOME/.zfunc
poetry completions zsh > ~/.zfunc/_poetry
#+END_SRC

#+RESULTS:
: Latest version is '3.8.2'

* Node
#+BEGIN_SRC shell
source $HOME/.zshrc
curl -fsSL https://raw.githubusercontent.com/nodenv/nodenv-installer/master/bin/nodenv-installer | bash

# Holy fuck I hate the Nodesystem
git clone https://github.com/momo-lab/xxenv-latest.git "$(nodenv root)"/plugins/xxenv-latest
# Fuck everything about node
nodenv latest install

nodenv global $(nodenv versions | tail -n 1)

npm install --global prettier
#+END_SRC

* Rust
#+BEGIN_SRC zsh
curl --proto '=https' --tlsv1.2 -sSf https://sh.rustup.rs | sh
source ~/.cargo/env

rustup toolchain add nightly
rustup component add rust-src
rustup component add clippy

cargo +nightly install racer
cargo install ripgrep

# Rust analyzer installation (because VS Code wants us to suffer)
# Requires:
# * Cargo
# * NodeJS
# * NPM
# * rust-src
git clone https://github.com/rust-analyzer/rust-analyzer.git /tmp/rust-analyzer
cd /tmp/rust-analyzer
cargo xtask install
#+END_SRC

#+RESULTS:

* Snap
#+BEGIN_SRC shell :dir "/sudo::"
snap install signal-desktop
snap install spotify
snap install bitwise
snap install chromium
#+END_SRC

#+RESULTS:

* KDE
#+BEGIN_SRC shell
file=RjGYtZL.jpg
pretty_name="susquehanna_park.jpg"
output_file="$HOME/Pictures/$pretty_name"
wget https://i.imgur.com/$file -O $output_file


dbus-send --session --dest=org.kde.plasmashell --type=method_call /PlasmaShell org.kde.PlasmaShell.evaluateScript 'string:
var Desktops = desktops();
for (i=0;i<Desktops.length;i++) {
        d = Desktops[i];
        d.wallpaperPlugin = "org.kde.image";
        d.currentConfigGroup = Array("Wallpaper",
                                    "org.kde.image",
                                    "General");
        d.writeConfig("Image", "file:/$output_file");

        console.log("$output_file");
}'

file=DCIcWc6.jpg
pretty_name="brothers_ruel.jpg"
output_file="$HOME/Pictures/$pretty_name"
wget https://i.imgur.com/$file -O $output_file
#+END_SRC

#+RESULTS:
